templates/cac_siem_create.xml

{% if priority == '1' %}
  {% set priority = '1000' %}
{% elif priority == '2' %}
  {% set priority = '2000' %}
{% elif priority == '3' %}
  {% set priority = '3000' %}
{% else %}
  {% set priority = '4000' %}
{% endif %}
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:HPD_IncidentInterface_Create_WS">
   <soapenv:Header>
      <urn:AuthenticationInfo>
         <urn:userName>*****</urn:userName>
         <urn:password>*****</urn:password>
         <!--Optional:-->
         <urn:authentication/>
         <!--Optional:-->
         <urn:locale/>
         <!--Optional:-->
         <urn:timeZone/>
      </urn:AuthenticationInfo>
   </soapenv:Header>
   <soapenv:Body>
      <urn:HelpDesk_Submit_Service>
         <!--Optional:-->
         <urn:Assigned_Group>iDO - Luxembourg - iServe</urn:Assigned_Group>
         <!--Optional:-->
         <urn:Assigned_Group_Shift_Name/>
         <!--Optional:-->
         <urn:Assigned_Support_Company>CSC</urn:Assigned_Support_Company>
         <!--Optional:-->
         <urn:Assigned_Support_Organization>iDO - Luxembourg</urn:Assigned_Support_Organization>
         <!--Optional:-->
         <urn:Assignee/>
         <!--Optional:-->
         <urn:Categorization_Tier_1>Default</urn:Categorization_Tier_1>
         <!--Optional:-->
         <urn:Categorization_Tier_2>Default</urn:Categorization_Tier_2>
         <!--Optional:-->
         <urn:Categorization_Tier_3>Default</urn:Categorization_Tier_3>
         <!--Optional:-->
         <urn:CI_Name/>
         <!--Optional:-->
         <urn:Closure_Manufacturer/>
         <!--Optional:-->
         <urn:Closure_Product_Category_Tier1/>
         <!--Optional:-->
         <urn:Closure_Product_Category_Tier2/>
         <!--Optional:-->
         <urn:Closure_Product_Category_Tier3/>
         <!--Optional:-->
         <urn:Closure_Product_Model_Version/>
         <!--Optional:-->
         <urn:Closure_Product_Name/>
         <!--Optional:-->
         <urn:Department/>
         <urn:First_Name>User</urn:First_Name>
         <urn:Impact>{{ priority }}</urn:Impact>
         <urn:Last_Name>Excellium</urn:Last_Name>
         <!--Optional:-->
         <urn:Lookup_Keyword/>
         <!--Optional:-->
         <urn:Manufacturer/>
         <!--Optional:-->
         <urn:Product_Categorization_Tier_1/>
         <!--Optional:-->
         <urn:Product_Categorization_Tier_2/>
         <!--Optional:-->
         <urn:Product_Categorization_Tier_3/>
         <!--Optional:-->
         <urn:Vendor_Ticket_Number>{{ case_name }}</urn:Vendor_Ticket_Number>
         <!--Optional:-->
         <urn:Product_Name/>
         <urn:Reported_Source>Other</urn:Reported_Source>
         <!--Optional:-->
         <urn:Resolution/>
         <!--Optional:-->
         <urn:Resolution_Category_Tier_1/>
         <!--Optional:-->
         <urn:Resolution_Category_Tier_2/>
         <!--Optional:-->
         <urn:Resolution_Category_Tier_3/>
         <urn:Service_Type>Infrastructure Event</urn:Service_Type>
         <urn:Status>1</urn:Status>
         <urn:Action>CREATE</urn:Action>
         <!--Optional:-->
         <urn:Create_Request/>
         <urn:Summary>{{ alert_name|truncate(70, True, '...') }} ({{ case_name }})</urn:Summary>
         <!--Optional:-->
         <urn:Notes>{{ comment }}</urn:Notes>
         <urn:Urgency>{{ priority }}</urn:Urgency>
         <!--Optional:-->
         <urn:Work_Info_Summary>{{ case_name }}</urn:Work_Info_Summary>
         <!--Optional:-->
         <urn:Work_Info_Notes>{{ alert_name }}</urn:Work_Info_Notes>
         <!--Optional:-->
         <urn:Work_Info_Type>8000</urn:Work_Info_Type>
         <!--Optional:-->
         <urn:Work_Info_Date/>
         <!--Optional:-->
         <urn:Work_Info_Source/>
         <!--Optional:-->
         <urn:Work_Info_Locked>No</urn:Work_Info_Locked>
         <!--Optional:-->
         <urn:Work_Info_View_Access>Internal</urn:Work_Info_View_Access>
         <!--Optional:-->
         <urn:Middle_Initial/>
         <!--Optional:-->
         <urn:Status_Reason/>
         <!--Optional:-->
         <urn:Direct_Contact_First_Name/>
         <!--Optional:-->
         <urn:Direct_Contact_Middle_Initial/>
         <!--Optional:-->
         <urn:Direct_Contact_Last_Name/>
         <!--Optional:-->
         <urn:TemplateID/>
         <!--Optional:-->
         <urn:ServiceCI/>
         <!--Optional:-->
         <urn:ServiceCI_ReconID/>
         <!--Optional:-->
         <urn:HPD_CI/>
         <!--Optional:-->
         <urn:HPD_CI_ReconID/>
         <!--Optional:-->
         <urn:HPD_CI_FormName/>
         <!--Optional:-->
         <urn:WorkInfoAttachment1Name/>
         <!--Optional:-->
         <urn:WorkInfoAttachment1Data/>
         <!--Optional:-->
         <urn:WorkInfoAttachment1OrigSize/>
         <!--Optional:-->
         <urn:Login_ID/>
         <!--Optional:-->
         <urn:Customer_Company/>
         <!--Optional:-->
         <urn:Corporate_ID/>
      </urn:HelpDesk_Submit_Service>
   </soapenv:Body>
</soapenv:Envelope>
